app/controllers/posts_controller.rb

def create
  @post = Post.create(post_params)
---
INSERT INTO "posts" ("caption", "created_at", "updated_at") VALUES (?, ?, ?)  [["caption", "No picture because YOLO"], ["created_at", "2016-05-30 15:35:50.696463"], ["updated_at", "2016-05-30 15:35:50.696463"]]